broadleaf-framework/overhead_evaluation/ab_with_pankti.log
============================= SUMMARY =============================
Connection Times (ms)
              min    mean[+/-sd]   median   max
Round 1:      262    313  37.6      314     456
Round 2:      222    277  42.9      271     352
Round 3:      215    255  30.1      247     343
Round 4:      240    285  79.0      271     679
Round 5:      258    303  43.6      294     435
AVERAGE:    239.4  286.6 46.64    279.4     453

============================= DETAILS =============================

This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   9.394 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    3.19 [#/sec] (mean)
Time per request:       313.148 [ms] (mean)
Time per request:       313.148 [ms] (mean, across all concurrent requests)
Transfer rate:          107.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   262  313  37.6    314     456
Waiting:      104  132  33.1    122     272
Total:        262  313  37.6    314     456

Percentage of the requests served within a certain time (ms)
  50%    314
  66%    319
  75%    325
  80%    332
  90%    339
  95%    382
  98%    456
  99%    456
 100%    456 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   8.318 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    3.61 [#/sec] (mean)
Time per request:       277.261 [ms] (mean)
Time per request:       277.261 [ms] (mean, across all concurrent requests)
Transfer rate:          121.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   222  277  42.8    271     351
Waiting:       87  106  14.5    111     141
Total:        222  277  42.9    271     352

Percentage of the requests served within a certain time (ms)
  50%    271
  66%    309
  75%    318
  80%    325
  90%    334
  95%    348
  98%    352
  99%    352
 100%    352 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   7.645 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    3.92 [#/sec] (mean)
Time per request:       254.824 [ms] (mean)
Time per request:       254.824 [ms] (mean, across all concurrent requests)
Transfer rate:          132.42 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   215  255  30.1    247     343
Waiting:       80   96  12.8     96     123
Total:        215  255  30.1    247     343

Percentage of the requests served within a certain time (ms)
  50%    247
  66%    252
  75%    276
  80%    279
  90%    297
  95%    319
  98%    343
  99%    343
 100%    343 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   8.566 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    3.50 [#/sec] (mean)
Time per request:       285.543 [ms] (mean)
Time per request:       285.543 [ms] (mean, across all concurrent requests)
Transfer rate:          118.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   239  285  79.0    271     679
Waiting:       83  114  79.5     94     529
Total:        240  285  79.0    271     679

Percentage of the requests served within a certain time (ms)
  50%    271
  66%    273
  75%    280
  80%    290
  90%    313
  95%    375
  98%    679
  99%    679
 100%    679 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /
Document Length:        34183 bytes

Concurrency Level:      1
Time taken for tests:   9.107 seconds
Complete requests:      30
Failed requests:        0
Total transferred:      1036620 bytes
HTML transferred:       1025490 bytes
Requests per second:    3.29 [#/sec] (mean)
Time per request:       303.555 [ms] (mean)
Time per request:       303.555 [ms] (mean, across all concurrent requests)
Transfer rate:          111.16 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:   257  303  43.6    294     435
Waiting:       87  104  15.9     99     153
Total:        258  303  43.6    294     435

Percentage of the requests served within a certain time (ms)
  50%    294
  66%    298
  75%    310
  80%    320
  90%    376
  95%    423
  98%    435
  99%    435
 100%    435 (longest request)